Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: ESP32 integrates two 12-bit SAR ADCs and supports measurements on 15 channels (analog-enabled pins).
it_it: L'ESP32 integra due ADC SAR a 12 bit e supporta misurazioni su 15 canali (pin analogici).

source: ESP32 is a single 2.4 GHz Wi-Fi-and-Bluetooth SoC (System On a Chip) designed by `Espressif Systems`_.
it_it: ESP32 è un singolo SoC (System On a Chip) Wi-Fi e Bluetooth a 2,4 GHz progettato da `Espressif Systems`_.

source: ESP32 is designed for mobile, wearable electronics, and Internet-of-Things (IoT) applications.
it_it: ESP32 è progettato per applicazioni di elettronica mobile, indossabile e Internet of Things (IoT)

source: ESP32 vs. ESP8266: Which Microcontroller Is Right for You?
it_it: ESP32 vs. ESP8266: Qual è il microcontrollore più adatto alle proprie esigenze?

source: ESP32-C2 is also supported by Arduino-ESP32 but requires using Arduino as an ESP-IDF component or rebuilding the static libraries.
it_it: ESP32-C2 è supportato anche da Arduino-ESP32 ma richiede l'uso di Arduino come componente ESP-IDF o si deve effettuare il rebuild delle librerie statiche.

source: ESP32-C3-DevKitM-1 (click to enlarge)
it_it: ESP32-C3-DevKitM-1 (cliccare per ingrandire)

source: ESP32-DevKitC-1 (click to enlarge)
it_it: ESP32-DevKitC-1 (cliccare per ingrandire)

source: ESPAsyncWebServer.h : is used to create an HTTP server that supports websocket endpoints.
it_it: ESPAsyncWebServer.h : viene utilizzato per creare un server HTTP che supporta endpoint websocket.

source: Each number in the sequence provides specific information about where that computer is located on the internet, similar to how your address includes your house number, street name, city, and zip code.
it_it: Ogni numero nella sequenza fornisce informazioni specifiche sulla posizione del computer su Internet, in modo simile a come l'indirizzo include il numero civico, il nome della via, la città e il codice postale.

source: Each of these functions works in a similar way.
it_it: Ognuna di queste funzioni lavora in modo simile.

source: Each service can have one or more characteristics and has its own unique numeric identifier, or UUID, which is either 16 bits (for officially adopted BLE Services) or 128 bits (for custom services).
it_it: Ogni servizio può avere una o più caratteristiche e un proprio identificatore numerico univoco, o UUID, che può essere di 16 bit (per i servizi BLE adottati ufficialmente) o di 128 bit (per i servizi personalizzati).

source: Each timer provides timing in synchronous or independent form, and each PWM operator generates a waveform for one PWM channel.
it_it: Ogni timer fornisce la temporizzazione in forma sincrona o indipendente e ogni operatore PWM genera una forma d'onda per un canale PWM.

source: Each timer provides timing in synchronous or independent form, and each PWM operator generates the waveform for one PWM channel.
it_it: Ogni timer fornisce la temporizzazione in forma sincrona o indipendente e ogni operatore PWM genera la forma d'onda per un canale PWM.

source: Each tool documentation should be provided and maintained by the community.
it_it: La documentazione di ogni tool deve essere fornita e gestita dalla community.

source: Enabling/Disabling Log Print
it_it: Abilitazione/Disabilitazione della stampa del Log

source: Enabling/Disabling Log Print During Booting and Timing of SDIO Slave
it_it: Abilitazione/disabilitazione della stampa del Log durante il boot e la temporizzazione dell'SDIO Slave

source: Enter one of the release links above into *Additional Board Manager URLs* field.
it_it: Inserire uno delle release sopra indicati nel campo *Additional Board Manager URLs*.

source: Even though the name “WebSocket” doesn’t seem to make sense at first glance, the concept behind it is actually quite simple, and you can get a basic understanding of it in no time.
it_it: Anche se il nome "WebSocket" a prima vista non sembra avere senso, il concetto alla base è in realtà piuttosto semplice e si può comprendere a fondo in pochissimo tempo.

source: Every single device connected to the internet, including web servers, has a unique IP address.
it_it: Ogni singolo dispositivo connesso a Internet, inclusi i server web, ha un indirizzo IP univoco.

source: Every time you refresh the page or someone else visits it, the counter goes up!
it_it: Ogni volta che si aggiorni la pagina o che qualcun altro la visita, il contatore aumenta!

source: Everyone is more than welcome to contribute back to this project.
it_it: Tutti sono più che benvenuti a contribuire a questo progetto.

source: Example 1 - Setting up an ESP32 Web Server in Station (STA) Mode
it_it: Esempio 1 - Configurazione di un server web ESP32 in modalità Stazione (STA)

source: Example 2 - Setting up an ESP32 Web Server in Access Point (AP) mode
it_it: Esempio 2 - Configurazione di un Server Web ESP32 in modalità Access Point (AP)

source: Example 3 - Displaying Sensor Readings on an ESP32 Web Server
it_it: Esempio 3 - Visualizzazione delle Letture dei Sensori su un Server Web ESP32

source: Example 4 - Controlling Physical Things with a Web Server
it_it: Esempio 4 - Controllo di Oggetti Fisici con un Server Web

source: Example Code
it_it: Codice di Esempio

source: Example sketch ```OTAWebUpdater.ino```.
it_it: Sketch di esempio ```OTAWebUpdater.ino```.

source: Examples
it_it: Esempi

source: Exporting Binary file of the Firmware (Code) - Open up the Arduino IDE - Open up the Code, for Exporting up Binary file - Now go to Sketch > export compiled Binary
it_it: Esportazione del File Binario del Firmware (Codice): Aprire l'IDE di Arduino, aprire il codice, per esportare il file binario: si va su Sketch > export compiled Binary

source: External Flash Support
it_it: Supporto Flash esterna

source: External Libraries Testing
it_it: Test delle Librerie Esterne

source: External SPI Flash
it_it: Flash SPI Esterna

source: FYI, there’s also encrypted wss:// protocol; it’s like HTTPS for websockets.
it_it: Per vostra informazione, esiste anche il protocollo crittografato wss:// ; è simile a HTTPS per i websocket.

source: Feature
it_it: Caratteristiche

source: Feel free to change it to make the website look the way you want it to.
it_it: Lo si può liberamente modificare per dare al sito web l'aspetto desiderato.

source: Fell free to ask for help in one of the community channels.
it_it: Si è liberi di chiedere aiuto in uno dei canali della community.

source: Fill in the “Additional Board Manager URLs” field with the following.
it_it: Compilare il campo "Additional Board Manager URLs" con quanto segue.

source: Filter your search by entering ‘esp32’.
it_it: Filtrare la ricerca inserendo ‘esp32’.

source: Finally, advertising parameters are configured, and the service is then advertised.
it_it: Infine, vengono configurati i parametri di advertising e il servizio viene pubblicizzato.

source: Finally, an event listener is attached to our toggle switch.
it_it: Infine, un event listener è collegato allo switch.

source: Finally, connect the ESP32 board to your computer and select the Port (if the COM port does not appear in your Arduino IDE, you will need to install the CP210x USB to UART Bridge VCP Drivers ):
it_it: Infine, si collega la scheda ESP32 al computer e si seleziona la Porta (se la porta COM non compare nell'IDE Arduino, si dovranno installare i CP210x USB to UART Bridge VCP Drivers ):

source: Finally, connect the ESP32 board to your computer and select the Port.
it_it: Infine, collegare la scheda ESP32 al computer e selezionare la Porta.

source: Finally, just like in all our other examples, the createHTML() function closes all the necessary HTML tags and returns the entire web page as a string.
it_it: Infine, proprio come in tutti gli altri esempi, la funzione createHTML() chiude tutti i tag HTML necessari e restituisce l'intera pagina web come stringa.

source: Finally, just like in our other examples, the function closes all the necessary HTML tags and sends the complete HTML string back to the server.send() function, which then delivers it to your browser.
it_it: Infine, proprio come negli altri esempi, la funzione chiude tutti i tag HTML necessari e invia la stringa HTML completa alla funzione server.send() , che a sua volta la invia al browser.

source: Finally, the function ends the HTML by closing up all the necessary tags.
it_it: Infine, la funzione termina l'HTML chiudendo tutti i tag necessari.

source: Finally, the web server is started.
it_it: Infine, il server web viene avviato.

source: Finally, there’s a paragraph that displays the state of the on-board LED.
it_it: Infine, c'è un paragrafo che mostra lo stato del LED integrato.

source: Finally, we call server.send() to send back a web page showing the current status of the LEDs.
it_it: Infine, chiamiamo server.send() per inviare una pagina web che mostra lo stato corrente dei LED.

source: Finally, we use server.begin() to tell the web server to start listening for incoming requests.
it_it: Infine, utilizziamo server.begin() per indicare al server web di iniziare ad ascoltare le richieste in arrivo.

source: Finally, we’ll build the most exciting project: controlling two LEDs over Wi-Fi.
it_it: Infine, realizzeremo il progetto più entusiasmante: controllare due LED tramite Wi-Fi.

source: Find the OneWire Library and click Install.
it_it: Trovare la libreria OneWire e cliccare su "Install".

source: First Steps
it_it: Primi Passi

source: First Things First
it_it: Prima di Tutto

source: First open your Arduino IDE program.
it_it: Aprire prima il programma nell'IDE di Arduino.

source: First things first,
it_it: Prima di tutto,

source: First, an event listener is attached to the window object to ensure that the entire JavaScript code executes only once the page has fully loaded.
it_it: Innanzitutto, un event listener viene associato all'oggetto window per garantire che l'intero codice JavaScript venga eseguito solo dopo il caricamento completo della pagina.

source: First, connect the VDD pin of the sensor to the 3.3V pin on the ESP32.
it_it: Per prima cosa, si collega il pin VDD del sensore al pin a 3,3 V dell'ESP32.

source: First, they update the LED’s status variable.
it_it: Innanzitutto, aggiornano la variabile di stato del LED.

source: First, we create a OneWire object and tell it which pin the sensor is connected to.
it_it: Innanzitutto, creiamo un oggetto OneWire e gli indichiamo a quale pin è collegato il sensore.

source: First, we set up the details for the Wi-Fi network the ESP32 will create.
it_it: Per prima cosa, impostiamo i dettagli della rete Wi-Fi che l'ESP32 creerà.

source: First, we’ll build a simple visitor counter using the ESP32.
it_it: Innanzitutto, realizzeremo un semplice contatore di visitatori utilizzando l'ESP32.

source: Follow any on-screen instructions.
it_it: Seguire le istruzioni sullo schermo.

source: Following that, the begin() method of the BluetoothSerial object is called, taking care of the lower-level initialization of the Bluetooth stack.
it_it: Successivamente, viene chiamato il metodo begin() dell'oggetto BluetoothSerial, che si occupa dell'inizializzazione di livello inferiore dello stack Bluetooth.

source: For Uploading the New Firmware, you need to provide the Binary File of your Code.
it_it: Per l'Uploading di New Firmware, si deve fornire il File Binario del proprio Codice.

source: For a practical demonstration, we’ll create a web page to control the on-board LED of the ESP32.
it_it: Per una dimostrazione pratica, creeremo una pagina web per controllare il LED integrato nell'ESP32.

source: For convenience, pins with similar functionality are grouped together.
it_it: Per comodità, i pin con funzionalità simili sono raggruppati.

source: For example, a single GPIO pin can act as an ADC input, DAC output, or touch pad.
it_it: Ad esempio, un singolo pin GPIO può fungere da ingresso ADC, uscita DAC o touch pad.

source: For example, if LED1status is ON, we show a blue slider (styled as ON) that links to /led1off , when clicked, it will turn the LED off.
it_it: Ad esempio, se LED1status è ON, mostriamo uno slider blu (con lo stile ON) che rimanda a /led1off ; cliccandoci sopra, il LED si spegne.

source: For example, if someone visits /led1on , the ESP32 will run a specific function ( handle_led1on() ) to turn LED1 on.
it_it: Ad esempio, se qualcuno visita /led1on , l'ESP32 eseguirà una funzione specifica ( handle_led1on() ) per accendere il LED1.

source: For example, if you’re building a robot in your garage where there’s no Wi-Fi, you could set your ESP32 to AP mode and connect your phone directly to it to control the robot.
it_it: Ad esempio, se si sta costruendo un robot nel garage in assenza di Wi-Fi, è possibile impostare l'ESP32 in modalità AP e collegare direttamente il telefono per controllare il robot.

source: For example, imagine you type something like http://192.168.1.1/led1on into your browser’s address bar and hit enter.
it_it: Ad esempio, si immagini di digitare qualcosa come http://192.168.1.1/led1on nella barra degli indirizzi del browser e di premere Invio.

source: For example, the ESP32 DevKit V1 uses the CP2102 to convert USB signals to UART signals, whereas the WeMos ESP32 Lite uses the CH340G.
it_it: Ad esempio, l'ESP32 DevKit V1 utilizza il CP2102 per convertire i segnali USB in segnali UART, mentre il WeMos ESP32 Lite utilizza il CH340G.

source: For example, the following code refreshes the page every second:
it_it: Ad esempio, il seguente codice aggiorna la pagina ogni secondo:

source: For example, the “Heart Rate Service” has a standardized 16-bit UUID of 0x180D, while the “Heart Rate Measurement” characteristic within the Heart Rate Service uses a UUID of 0x2A37.
it_it: Ad esempio, il “Heart Rate Service” ha un UUID standardizzato a 16 bit pari a 0x180D, mentre la caratteristica "Heart Rate Measurement" all'interno del "Heart Rate Service" utilizza un UUID pari a 0x2A37.

source: For extensive information about the ESP32, please refer to the datasheet.
it_it: Per informazioni dettagliate sull'ESP32, consultare la scheda tecnica.

source: For instance, a hands-free Bluetooth headset uses the headset profile (HSP), whereas a wireless keyboard uses the human interface device (HID) profile.
it_it: Ad esempio, un auricolare Bluetooth vivavoce utilizza il profilo "headset" [auricolare] (HSP), mentre una tastiera wireless utilizza il profilo "human interface device" (HID).

source: For instance, in a low-power IoT sensor hub application scenario, ESP32 is woken-up periodically and only when a specified condition is detected.
it_it: Ad esempio, in uno scenario applicativo con hub di sensori IoT a basso consumo, l'ESP32 viene attivato periodicamente e solo quando viene rilevata una condizione specifica.

source: For instance, it can be used as a starting point for creating a smart home lighting system.
it_it: Ad esempio, può essere utilizzato come punto di partenza per la creazione di un sistema di illuminazione per la casa intelligente.

source: For instance, let’s consider the Heart Rate Service.
it_it: Ad esempio, consideriamo il "Heart Rate Service" [servizio di frequenza cardiaca].

source: For instance, you can associate M1 with the “on” message and M2 with the “off” message.
it_it: Ad esempio, si può associare M1 al messaggio “on” e M2 al messaggio “off”.

source: For less than $3, you could get a programmable, WiFi-enabled microcontroller capable of monitoring and controlling things from anywhere in the world.
it_it: Per meno di 3 dollari, era possibile ottenere un microcontrollore programmabile e abilitato al WiFi, in grado di monitorare e controllare dispositivi da qualsiasi parte del mondo.

source: For more detailed information, see the `ESP32-C3`_ datasheet.
it_it: Per informazioni più dettagliate, consultare il datasheet di `ESP32-C3`_.

source: For more details about creating new Issue, see the `Issue Template <https://github.com/espressif/arduino-esp32/blob/master/.github/ISSUE_TEMPLATE/Issue-report.yml>`_.
it_it: Per maggiori dettagli sulla creazione di una nuova segnalazione, consultare lo `Issue Template <https://github.com/espressif/arduino-esp32/blob/master/.github/ISSUE_TEMPLATE/Issue-report.yml>`_.

source: For more information about the update process, please refer to the `OTA API reference <https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/ota.html>`_ section of the ESP-IDF documentation.
it_it: Per ulteriori informazioni sul processo di aggiornamento, consultare la sezione `Riferimento API OTA <https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/ota.html>`_ della documentazione ESP-IDF.

source: For more information, check out Espressif’s Bluetooth architecture description.
it_it: Per maggiori informazioni, consultare la descrizione dell' architettura Bluetooth di Espressif .

source: For more information, please refer to this tutorial.
it_it: Per ulteriori informazioni, consultare questo tutorial.

source: For more information, refer to our comprehensive ESP32 pinout guide.
it_it: Per ulteriori informazioni, consultare la nostra guida completa al pinout dell'ESP32.

source: For more information, see the `Arduino as an ESP-IDF component documentation <esp-idf_component.html>`_ or the `Lib Builder documentation <lib_builder.html>`_, respectively.
it_it: Per ulteriori informazioni, consultare la `Documentazione di Arduino come componente ESP-IDF <esp-idf_component.html>`_ oppure la `Documentazione di Lib Builder <lib_builder.html>`_, rispettivamente.

source: For more information, visit the ESP32 Arduino GitHub repository .
it_it: Per ulteriori informazioni, visitare il repository GitHub di ESP32 Arduino .

source: For now, we have not checked that value, but for a robust code you should always include error checks.
it_it: Per ora, non abbiamo verificato tale valore, ma per un codice robusto è consigliabile includere sempre i controlli di errore.

source: For our second project, we’re going to build the same visitor counter web server on the ESP32, but this time in Access Point (AP) mode.
it_it: Per il nostro secondo progetto, realizzeremo lo stesso server web per il conteggio dei visitatori sull'ESP32, ma questa volta in modalità Access Point (AP).

source: For overview of SoC's support, take a look on `Supported Soc's table <https://docs.espressif.com/projects/arduino-esp32/en/latest/getting_started.html#supported-soc-s>`_ where you can find if the particular chip is under stable or development release.
it_it: Per una panoramica del supporto SoC, consultare la `Tabella dei Soc Supportati <https://docs.espressif.com/projects/arduino-esp32/en/latest/getting_started.html#supported-soc-s>`_, dove si può verificare se il chip in questione è in versione stabile o in fase di sviluppo.

source: For reference, the WiFi.status() function can return the following statuses:
it_it: A titolo di riferimento, la funzione WiFi.status() può restituire i seguenti stati:

source: For the Fahrenheit temperature, we first use a mathematical formula to convert the Celsius temperature into Fahrenheit, and then we also convert that result into a string, also with one decimal point, before adding it to the webpage.
it_it: Per la temperatura in gradi Fahrenheit, utilizziamo prima una formula matematica per convertire la temperatura in gradi Celsius in gradi Fahrenheit, quindi convertiamo anche il risultato in una stringa, sempre con una virgola decimale, prima di aggiungerla alla pagina web.

source: For the data connection, connect the sensor’s DQ (data) pin to GPIO 15 on the ESP32.
it_it: Per la connessione dati, si collega il pin DQ (dati) del sensore al GPIO 15 dell'ESP32.

source: For this reason, it is not a suitable solution for such a system.
it_it: Per questo motivo, non è una soluzione adatta per un sistema di questo tipo.

source: Fortunately, the amazing ESP32 community recently took the IDE selection a step further by creating an Arduino add-on.
it_it: Fortunatamente, la straordinaria community di ESP32 ha recentemente portato la selezione dell'IDE a un livello superiore creando un add-on per Arduino.

source: Frequency Band
it_it: Banda di Frequenza

source: Frequently Asked Questions
it_it: Domande frequenti

source: From a GATT perspective, when two devices are connected, they are each in one of two roles.
it_it: Dal punto di vista GATT, quando due dispositivi sono connessi, ciascuno di essi ricopre uno dei due ruoli seguenti.

source: From menu ``Remote`` select ``Fetch from`` > ``origin``
it_it: Dal menù ``Remote`` selezionare ``Fetch from`` > ``origin``

source: Full Comparison
it_it: Confronto Completo

source: Full quadrature decoding
it_it: Decodifica "Full Quadrature"

source: Full-speed USB Serial/JTAG controller
it_it: Controller USB Seriale/JTAG a piena velocità

source: Function
it_it: Funzione

source: Furthermore, the ESP32 has Bluetooth v4.2 BR/EDR and BLE (Bluetooth Low Energy) capabilities, which the ESP8266 lacks.
it_it: Inoltre, l'ESP32 è dotato di Bluetooth v4.2 BR/EDR e BLE (Bluetooth Low Energy), di cui l'ESP8266 è sprovvisto.

source: GAP controls connections and advertising in Bluetooth.
it_it: GAP controlla le connessioni e la pubblicità in Bluetooth.

source: GAP defines various roles for devices, but the two key concepts to keep in mind are Central devices and Peripheral devices.
it_it: Il GAP definisce diversi ruoli per i dispositivi, ma i due concetti chiave da tenere a mente sono dispositivi Centrali e Periferici.

source: GAP is what makes your device visible to the outside world and determines how two devices discover and establish a connection with each other.
it_it: Il GAP è ciò che rende il dispositivo visibile al mondo esterno e determina come due dispositivi si scoprono e stabiliscono una connessione tra loro.

source: GATT Server and GATT Client
it_it: Server GATT e Client GATT

source: GATT specifies how data should be organized and how two BLE devices should share data.
it_it: GATT specifica come devono essere organizzati i dati e come due dispositivi BLE devono condividerli.

source: GHz ISM band
it_it: Banda GHz ISM

source: GND is the ground pin.
it_it: GND è il pin della massa.

source: GPIO Pins The ESP32 development board has 25 GPIO pins that can be assigned different functions by programming the appropriate registers.
it_it: Pin GPIO La scheda di sviluppo ESP32 ha 25 pin GPIO a cui possono essere assegnate diverse funzioni programmando gli appositi registri.

source: GPIO2, GPIO8, and GPIO9 are strapping pins of the ESP32-C3FN4 chip.
it_it: GPIO2, GPIO8 e GPIO9 sono pin di strapping del chip ESP32-C3FN4.

source: GPIOs
it_it: GPIO

source: General DMA controller (GDMA), with 3 transmit channels and 3 receive channels
it_it: Controller General DMA (GDMA), con 3 canali di trasmissione e 3 canali di ricezione

source: Getting Started
it_it: Introduzione

source: Getting Started with ESP32
it_it: Introduzione a ESP32

source: Go ahead and try clicking the button for LED2 as well and observe how it responds.
it_it: Provare anche a cliccare sul pulsante per LED2 e osservare come risponde.

source: Guides
it_it: Guide

source: HSPI is sometimes misinterpreted as “Hardware” SPI and VSPI as “Virtual or Software” SPI.
it_it: HSPI viene talvolta erroneamente interpretato come SPI "Hardware" e VSPI come SPI "Virtuale o Software".

source: HTTP Polling
it_it: Polling HTTP

source: HTTP Polling is a method where the browser automatically sends repeated HTTP requests to the web server at regular, timed intervals.
it_it: Il polling HTTP è un metodo in cui il browser invia automaticamente richieste HTTP ripetute al server web a intervalli regolari e temporizzati.

source: Hall effect sensor
it_it: Sensore a Effetto Hall
